# Solución 1

## Primera parte

In [ ]:
import pandas as pd

df = pd.read_csv("input.txt",sep=r"\s+",names=["0","1"])
dfsorted = pd.DataFrame()
dfsorted["0"] = df["0"].sort_values(ignore_index=True)
dfsorted["1"] = df["1"].sort_values(ignore_index=True)
dfsorted["result_diff"] = dfsorted["0"] - dfsorted["1"]
dfsorted["result_diff"] = dfsorted["result_diff"].abs()
print("Resultado = "+str(dfsorted["result_diff"].sum()))

Resultado = 2264607

In [138]:
dfsorted

         0      1  result_diff
0    10123  10180           57
1    10212  10321          109
2    10332  10684          352
3    10447  10738          291
4    10499  10820          321
..     ...    ...          ...
995  99720  99914          194
996  99742  99914          172
997  99797  99914          117
998  99835  99914           79
999  99914  99914            0

[1000 rows x 3 columns]

## Segunda parte

In [93]:
dfsorted.drop(columns=["result_diff"],inplace=True)

In [ ]:
dfa = pd.DataFrame()
dfb = pd.DataFrame()
dfa = dfsorted.groupby(["0"],as_index=False).count()
dfb = dfsorted.groupby(["1"],as_index=False).count().rename(columns={"0":"1", "1":"0"})

In [125]:
dfa #dfa tiene valores unicos

         0  1
0    10123  1
1    10212  1
2    10332  1
3    10447  1
4    10499  1
..     ... ..
995  99720  1
996  99742  1
997  99797  1
998  99835  1
999  99914  1

[1000 rows x 2 columns]

In [126]:
dfb # dfb tiene los valores diferentes

         0   1
0    10180   1
1    10321   1
2    10684   1
3    10738   1
4    10820   1
..     ...  ..
669  99460   1
670  99483   1
671  99566   1
672  99699   1
673  99914  11

[674 rows x 2 columns]

In [139]:
dfresult = dfa.merge(dfb,how="inner",on=["0"])
dfresult["index"] = dfresult["0"] * dfresult["1_y"]
result2 = dfresult["index"].sum()
print("Resultado = " + str(result2))

Resultado = 19457120

# Solución 2

## Primera parte

In [ ]:
import re
v1 = []
v2 = []

with open("input.txt") as f:
    while line := f.readline():
        line = line.strip()
        line_split = re.split(r"\s+",line)
        v1.append(int(line_split[0]))
        v2.append(int(line_split[1]))

v1.sort()
v2.sort()
result = sum([abs(r1-r2) for r1,r2 in zip(v1,v2)])
print("Resultado = "+str(result))

Resultado = 2264607

## Segunda parte

In [200]:
mapv1 = {x: 0 for x in v1}

for r in v2:
    if r in v1:
        mapv1[r] += 1
        
res = sum(mapv1[c] * c for c in mapv1)

print("Resultado = " + str(res))

Resultado = 19457120